#include<stdio.h>

int main() {

    // 输入样例:
    // 1 1
    // 2 2
    // 3 3
    // 4 4
    // 输出样例:
    // 2
    // 4
    // 6
    // 8
    
    // 打开文件方式(模式字符串)列表:
    // 模式字符串 	含义
    // "r" 	        读模式
    // "w" 	        写模式,打开时,现有文件内容截为0,文件不存在时创建
    // "a" 	        写模式,在现有文件末尾写入数据,文件不存在时创建
    // "r+"         更新模式打开(可以读写)
    // "w+"         更新模式打开(可以读写),现有文件内容截为0,文件不存在时创建
    // "a+"         更新模式打开(可以读写),在现有文件末尾写入数据,文件不存在时创建
    // "rb","wb","ab","rb+","r+b","wb+","w+b","ab+","a+b" 	与上述模式类似,区别在于:以二进制而不是以文本模式打开文件,linux和unix下只有一种文件类型,此时与上述类型无差别
    // "wx","wbx","w+x","wb+x"或"w+bx" 	C(11)及以上支持,与上述类似,区别在于以独占方式打开,如果文件已打开,则打开失败且读写时不会将现有文件内容截为0,成功打开后,其他程序不可访问该文件
	int ch1, ch2;
	FILE* fin, * fout;
	fin = fopen("输入.txt", "rb");
	if ((fin = fopen("输入.txt", "rb")) == NULL) {
		printf("打开文件失败!\n");
		exit(0);
	}
	fout = fopen("输出.txt", "wb");
	while (fscanf(fin, "%d%d", &ch1, &ch2) != EOF) {
		fprintf(fout, "%d\n", ch1 + ch2);
		printf("%d\n", ch1 + ch2);
	}
	fclose(fin);
	fclose(fout);
	return 0;
}


