// 返回一个数的补码需要多少bit，正负数均考虑符号位
// 对于正数，我们需要找到最高位的1
// 对于负数，我们需要找到最高位的0
int howManyBits(int x) {
    int sign = (x >> 31);
    int b16,b8,b4,b2,b1,b0;
    // 将正负情况统一为寻找最高位的1
    x = (~sign & x) | (sign & ~x);

    b16 = !!(x >> 16) << 4;
    x >>= b16;
    b8 = !!(x >> 8) << 3;
    x >>= b8;
    b4 = !!(x >> 4) << 2;
    x >>= b4;
    b2 = !!(x >> 2) << 1;
    x >>= b2;
    b1 = !!(x >> 1);// << 0;
    x >>= b1;
    // b0 = !!(x >> 0);// << 0;
    b0 = x;
    // 最后+的1是符号
    return b16 + b8 + b4 + b2 + b1 + b0 + 1;
}
